; domain
(define (domain hanoi)
  (:types
    disk
    peg
  )
  (:predicates
    (on ?d_above - disk ?d_below - disk)          ; A disk is on a peg - observed predicate
    (on-peg ?d - disk ?p - peg)          ; A disk is on a peg - observed predicate
    (clear ?d - disk)                 ; A disk has no other disk on top - derived predicate
    (smaller ?d1 - disk ?d2 - disk)  ; A disk is smaller than another disk - observed predicate
  )

  ; Action: move a disk from one peg to another
  (:action move
    :parameters (?d - disk ?from - peg ?to - peg)
    :precondition (and
                    (on-peg ?d ?from)             ; The disk is on the "from" peg
                    (clear ?d)              ; The disk to move has nothing on top of it
                    (not (on-peg ?d ?to))        ; The disk should not already be on the "to" peg
                    ; Ensure no larger disk is already on the "to" peg
                    (forall (?d2 - disk)
                      (or
                        (not (on-peg ?d2 ?to))          ; There is a disk on the "to" peg
                        (smaller ?d ?d2)      ; The disk being moved must be smaller
                      )
                    )
                   )
    :effect (and
              ; The disk that was below ?d on ?from is now clear
              (forall (?d2 - disk)
                (when 
                 (on ?d ?d2)
                 (and (clear ?d2) (not(on ?d ?d2)))
                )
              )
              (not (on-peg ?d ?from))        ; The disk is no longer on the "from" peg
              (on-peg ?d ?to)               ; The disk is now on the "to" peg

              ; The disk below ?d is no longer clear
              (forall (?d2 - disk)
                (when 
                 (and (on-peg ?d2 ?to) (clear ?d2) ) ; if disk is on top of target peg
                 (and 
                    (not (clear ?d2))  ; than this disk is no longer clear 
                    (on ?d ?d2) ; and ?d is now on top of it
                 ) 
                )
              )
            )
    )
)

; problem
(define (problem hanoi10)
(:domain hanoi)
(:objects
    colored_disk - disk
    colored_disk1 - disk
    colored_disk2 - disk
    colored_disk3 - disk
    colored_disk4 - disk
    rightmost_peg - peg
    wooden_stick1 - peg
    wooden_stick2 - peg
)
(:init
    ( clear colored_disk4 )
    ( on colored_disk colored_disk3 )
    ( on colored_disk1 colored_disk )
    ( on colored_disk2 colored_disk1 )
    ( on colored_disk4 colored_disk2 )
    ( on-peg colored_disk wooden_stick2 )
    ( on-peg colored_disk1 wooden_stick2 )
    ( on-peg colored_disk2 wooden_stick2 )
    ( on-peg colored_disk3 wooden_stick2 )
    ( on-peg colored_disk4 wooden_stick2 )
    ( smaller colored_disk colored_disk3 )
    ( smaller colored_disk1 colored_disk )
    ( smaller colored_disk1 colored_disk3 )
    ( smaller colored_disk2 colored_disk )
    ( smaller colored_disk2 colored_disk1 )
    ( smaller colored_disk2 colored_disk3 )
    ( smaller colored_disk4 colored_disk )
    ( smaller colored_disk4 colored_disk1 )
    ( smaller colored_disk4 colored_disk2 )
    ( smaller colored_disk4 colored_disk3 )
)

    (:goal
      (forall (?d - disk) (on-peg ?d rightmost_peg) )
    )
)

; plan
1. (move colored_disk4 wooden_stick2 wooden_stick1)
   deleted: (on colored_disk4 colored_disk2) (on-peg colored_disk4 wooden_stick2)
   added: (clear colored_disk2) (on-peg colored_disk4 wooden_stick1)
   goals met: 0 of 1
2. (move colored_disk2 wooden_stick2 rightmost_peg)
   deleted: (on colored_disk2 colored_disk1) (on-peg colored_disk2 wooden_stick2)
   added: (clear colored_disk1) (on-peg colored_disk2 rightmost_peg)
   goals met: 0 of 1
3. (move colored_disk4 wooden_stick1 rightmost_peg)
   deleted: (on-peg colored_disk4 wooden_stick1) (clear colored_disk2)
   added: (on-peg colored_disk4 rightmost_peg) (on colored_disk4 colored_disk2)
   goals met: 0 of 1
4. (move colored_disk1 wooden_stick2 wooden_stick1)
   deleted: (on colored_disk1 colored_disk) (on-peg colored_disk1 wooden_stick2)
   added: (clear colored_disk) (on-peg colored_disk1 wooden_stick1)
   goals met: 0 of 1
5. (move colored_disk4 rightmost_peg wooden_stick2)
   deleted: (on colored_disk4 colored_disk2) (on-peg colored_disk4 rightmost_peg) (clear colored_disk)
   added: (clear colored_disk2) (on-peg colored_disk4 wooden_stick2) (on colored_disk4 colored_disk)
   goals met: 0 of 1
6. (move colored_disk2 rightmost_peg wooden_stick1)
   deleted: (on-peg colored_disk2 rightmost_peg) (clear colored_disk1)
   added: (on-peg colored_disk2 wooden_stick1) (on colored_disk2 colored_disk1)
   goals met: 0 of 1
7. (move colored_disk4 wooden_stick2 wooden_stick1)
   deleted: (on colored_disk4 colored_disk) (on-peg colored_disk4 wooden_stick2) (clear colored_disk2)
   added: (clear colored_disk) (on-peg colored_disk4 wooden_stick1) (on colored_disk4 colored_disk2)
   goals met: 0 of 1
8. (move colored_disk wooden_stick2 rightmost_peg)
   deleted: (on colored_disk colored_disk3) (on-peg colored_disk wooden_stick2)
   added: (clear colored_disk3) (on-peg colored_disk rightmost_peg)
   goals met: 0 of 1
9. (move colored_disk4 wooden_stick1 rightmost_peg)
   deleted: (on colored_disk4 colored_disk2) (on-peg colored_disk4 wooden_stick1) (clear colored_disk)
   added: (clear colored_disk2) (on-peg colored_disk4 rightmost_peg) (on colored_disk4 colored_disk)
   goals met: 0 of 1
10. (move colored_disk2 wooden_stick1 wooden_stick2)
   deleted: (on colored_disk2 colored_disk1) (on-peg colored_disk2 wooden_stick1) (clear colored_disk3)
   added: (clear colored_disk1) (on-peg colored_disk2 wooden_stick2) (on colored_disk2 colored_disk3)
   goals met: 0 of 1
11. (move colored_disk4 rightmost_peg wooden_stick2)
   deleted: (on colored_disk4 colored_disk) (on-peg colored_disk4 rightmost_peg) (clear colored_disk2)
   added: (clear colored_disk) (on-peg colored_disk4 wooden_stick2) (on colored_disk4 colored_disk2)
   goals met: 0 of 1
12. (move colored_disk1 wooden_stick1 rightmost_peg)
   deleted: (on-peg colored_disk1 wooden_stick1) (clear colored_disk)
   added: (on-peg colored_disk1 rightmost_peg) (on colored_disk1 colored_disk)
   goals met: 0 of 1
13. (move colored_disk4 wooden_stick2 rightmost_peg)
   deleted: (on colored_disk4 colored_disk2) (on-peg colored_disk4 wooden_stick2) (clear colored_disk1)
   added: (clear colored_disk2) (on-peg colored_disk4 rightmost_peg) (on colored_disk4 colored_disk1)
   goals met: 0 of 1
14. (move colored_disk2 wooden_stick2 wooden_stick1)
   deleted: (on colored_disk2 colored_disk3) (on-peg colored_disk2 wooden_stick2)
   added: (clear colored_disk3) (on-peg colored_disk2 wooden_stick1)
   goals met: 0 of 1
15. (move colored_disk4 rightmost_peg wooden_stick1)
   deleted: (on colored_disk4 colored_disk1) (on-peg colored_disk4 rightmost_peg) (clear colored_disk2)
   added: (clear colored_disk1) (on-peg colored_disk4 wooden_stick1) (on colored_disk4 colored_disk2)
   goals met: 0 of 1
16. (move colored_disk1 rightmost_peg wooden_stick2)
   deleted: (on colored_disk1 colored_disk) (on-peg colored_disk1 rightmost_peg) (clear colored_disk3)
   added: (clear colored_disk) (on-peg colored_disk1 wooden_stick2) (on colored_disk1 colored_disk3)
   goals met: 0 of 1
17. (move colored_disk4 wooden_stick1 rightmost_peg)
   deleted: (on colored_disk4 colored_disk2) (on-peg colored_disk4 wooden_stick1) (clear colored_disk)
   added: (clear colored_disk2) (on-peg colored_disk4 rightmost_peg) (on colored_disk4 colored_disk)
   goals met: 0 of 1
18. (move colored_disk2 wooden_stick1 wooden_stick2)
   deleted: (on-peg colored_disk2 wooden_stick1) (clear colored_disk1)
   added: (on-peg colored_disk2 wooden_stick2) (on colored_disk2 colored_disk1)
   goals met: 0 of 1
19. (move colored_disk4 rightmost_peg wooden_stick2)
   deleted: (on colored_disk4 colored_disk) (on-peg colored_disk4 rightmost_peg) (clear colored_disk2)
   added: (clear colored_disk) (on-peg colored_disk4 wooden_stick2) (on colored_disk4 colored_disk2)
   goals met: 0 of 1
20. (move colored_disk rightmost_peg wooden_stick1)
   deleted: (on-peg colored_disk rightmost_peg)
   added: (on-peg colored_disk wooden_stick1)
   goals met: 0 of 1
21. (move colored_disk4 wooden_stick2 wooden_stick1)
   deleted: (on colored_disk4 colored_disk2) (on-peg colored_disk4 wooden_stick2) (clear colored_disk)
   added: (clear colored_disk2) (on-peg colored_disk4 wooden_stick1) (on colored_disk4 colored_disk)
   goals met: 0 of 1
22. (move colored_disk2 wooden_stick2 rightmost_peg)
   deleted: (on colored_disk2 colored_disk1) (on-peg colored_disk2 wooden_stick2)
   added: (clear colored_disk1) (on-peg colored_disk2 rightmost_peg)
   goals met: 0 of 1
23. (move colored_disk4 wooden_stick1 rightmost_peg)
   deleted: (on colored_disk4 colored_disk) (on-peg colored_disk4 wooden_stick1) (clear colored_disk2)
   added: (clear colored_disk) (on-peg colored_disk4 rightmost_peg) (on colored_disk4 colored_disk2)
   goals met: 0 of 1
24. (move colored_disk1 wooden_stick2 wooden_stick1)
   deleted: (on colored_disk1 colored_disk3) (on-peg colored_disk1 wooden_stick2) (clear colored_disk)
   added: (clear colored_disk3) (on-peg colored_disk1 wooden_stick1) (on colored_disk1 colored_disk)
   goals met: 0 of 1
25. (move colored_disk4 rightmost_peg wooden_stick2)
   deleted: (on colored_disk4 colored_disk2) (on-peg colored_disk4 rightmost_peg) (clear colored_disk3)
   added: (clear colored_disk2) (on-peg colored_disk4 wooden_stick2) (on colored_disk4 colored_disk3)
   goals met: 0 of 1
26. (move colored_disk2 rightmost_peg wooden_stick1)
   deleted: (on-peg colored_disk2 rightmost_peg) (clear colored_disk1)
   added: (on-peg colored_disk2 wooden_stick1) (on colored_disk2 colored_disk1)
   goals met: 0 of 1
27. (move colored_disk4 wooden_stick2 wooden_stick1)
   deleted: (on colored_disk4 colored_disk3) (on-peg colored_disk4 wooden_stick2) (clear colored_disk2)
   added: (clear colored_disk3) (on-peg colored_disk4 wooden_stick1) (on colored_disk4 colored_disk2)
   goals met: 0 of 1
28. (move colored_disk3 wooden_stick2 rightmost_peg)
   deleted: (on-peg colored_disk3 wooden_stick2)
   added: (on-peg colored_disk3 rightmost_peg)
   goals met: 0 of 1
29. (move colored_disk4 wooden_stick1 wooden_stick2)
   deleted: (on colored_disk4 colored_disk2) (on-peg colored_disk4 wooden_stick1)
   added: (clear colored_disk2) (on-peg colored_disk4 wooden_stick2)
   goals met: 0 of 1
30. (move colored_disk2 wooden_stick1 rightmost_peg)
   deleted: (on colored_disk2 colored_disk1) (on-peg colored_disk2 wooden_stick1) (clear colored_disk3)
   added: (clear colored_disk1) (on-peg colored_disk2 rightmost_peg) (on colored_disk2 colored_disk3)
   goals met: 0 of 1
31. (move colored_disk4 wooden_stick2 rightmost_peg)
   deleted: (on-peg colored_disk4 wooden_stick2) (clear colored_disk2)
   added: (on-peg colored_disk4 rightmost_peg) (on colored_disk4 colored_disk2)
   goals met: 0 of 1
32. (move colored_disk1 wooden_stick1 wooden_stick2)
   deleted: (on colored_disk1 colored_disk) (on-peg colored_disk1 wooden_stick1)
   added: (clear colored_disk) (on-peg colored_disk1 wooden_stick2)
   goals met: 0 of 1
33. (move colored_disk4 rightmost_peg wooden_stick1)
   deleted: (on colored_disk4 colored_disk2) (on-peg colored_disk4 rightmost_peg) (clear colored_disk)
   added: (clear colored_disk2) (on-peg colored_disk4 wooden_stick1) (on colored_disk4 colored_disk)
   goals met: 0 of 1
34. (move colored_disk2 rightmost_peg wooden_stick2)
   deleted: (on colored_disk2 colored_disk3) (on-peg colored_disk2 rightmost_peg) (clear colored_disk1)
   added: (clear colored_disk3) (on-peg colored_disk2 wooden_stick2) (on colored_disk2 colored_disk1)
   goals met: 0 of 1
35. (move colored_disk4 wooden_stick1 wooden_stick2)
   deleted: (on colored_disk4 colored_disk) (on-peg colored_disk4 wooden_stick1) (clear colored_disk2)
   added: (clear colored_disk) (on-peg colored_disk4 wooden_stick2) (on colored_disk4 colored_disk2)
   goals met: 0 of 1
36. (move colored_disk wooden_stick1 rightmost_peg)
   deleted: (on-peg colored_disk wooden_stick1) (clear colored_disk3)
   added: (on-peg colored_disk rightmost_peg) (on colored_disk colored_disk3)
   goals met: 0 of 1
37. (move colored_disk4 wooden_stick2 rightmost_peg)
   deleted: (on colored_disk4 colored_disk2) (on-peg colored_disk4 wooden_stick2) (clear colored_disk)
   added: (clear colored_disk2) (on-peg colored_disk4 rightmost_peg) (on colored_disk4 colored_disk)
   goals met: 0 of 1
38. (move colored_disk2 wooden_stick2 wooden_stick1)
   deleted: (on colored_disk2 colored_disk1) (on-peg colored_disk2 wooden_stick2)
   added: (clear colored_disk1) (on-peg colored_disk2 wooden_stick1)
   goals met: 0 of 1
39. (move colored_disk4 rightmost_peg wooden_stick1)
   deleted: (on colored_disk4 colored_disk) (on-peg colored_disk4 rightmost_peg) (clear colored_disk2)
   added: (clear colored_disk) (on-peg colored_disk4 wooden_stick1) (on colored_disk4 colored_disk2)
   goals met: 0 of 1
40. (move colored_disk1 wooden_stick2 rightmost_peg)
   deleted: (on-peg colored_disk1 wooden_stick2) (clear colored_disk)
   added: (on-peg colored_disk1 rightmost_peg) (on colored_disk1 colored_disk)
   goals met: 0 of 1
41. (move colored_disk4 wooden_stick1 wooden_stick2)
   deleted: (on colored_disk4 colored_disk2) (on-peg colored_disk4 wooden_stick1)
   added: (clear colored_disk2) (on-peg colored_disk4 wooden_stick2)
   goals met: 0 of 1
42. (move colored_disk2 wooden_stick1 rightmost_peg)
   deleted: (on-peg colored_disk2 wooden_stick1) (clear colored_disk1)
   added: (on-peg colored_disk2 rightmost_peg) (on colored_disk2 colored_disk1)
   goals met: 0 of 1
43. (move colored_disk4 wooden_stick2 rightmost_peg)
   deleted: (on-peg colored_disk4 wooden_stick2) (clear colored_disk2)
   added: (on-peg colored_disk4 rightmost_peg) (on colored_disk4 colored_disk2)
   goals met: 1 of 1
